//=============================================================================
//Name		:Isr.c
//Purpose	:中断处理函数
//Version	:V1.0
//Author	:szl
//Date		:2019.01.19
//=============================================================================
#include "AllHeadFile.h"
//=============================================================================

//=============================================================================
//定时器0，中断处理函数	//256hz
void TM0_INT(void) 	interrupt	1
{	
	//重要：必须靠前
	TH0=D_TM0H;								
	TL0=D_TM0L;							//手动重载
	
	Freq128Hz++;
	if(Freq128Hz>7)
	{
		Freq128Hz = 0;
		b32HzFlag = 1;
	}	
	  	
	
	TF0=0;								//TM0中断标志清零	
}
//=============================================================================
//定时器1，中断处理函数	//8k	
void TM1_INT(void) 	interrupt	3
{							
	TH1=D_TM1H;
	TL1=D_TM1L;
	
	CheckReceiveData();
	
	TF1=0;									//TM1中断标志清零								    			
}
//=============================================================================
//定时器2，中断处理函数
//void TM2_INT(void) 	interrupt	5
//{
//	TF2 = 0;								//清TM2溢出中断标志
//}
//=============================================================================
//定时器3，中断处理函数
void TM3_INT(void) 	interrupt	7
{
	b2HzFlag = 1;
	INTFLG &= ~TF3;							//清TM3中断标志
}
//=============================================================================
//IO，中断处理函数
//void PXIF_INT(void) 	interrupt	8
//{
//	if(IntCnt<255)
//	  IntCnt++;
//	INTFLG &= ~PCIF;							//清P1IF中断标志
//	INTPORT = 0x00;
//}

////INT1，中断处理函数
//void INT1_INT(void) 	interrupt	2
//{
//	bInt1Int = 1;
//	IE1 = 0;						
//}

//INT0，中断处理函数
//void INT0_INT(void) 	interrupt	0
//{
//	if(IntCnt<255)
//	  IntCnt++;
//	IE0 = 0;							
//}

////IO，中断处理函数
//void INT2_INT(void) 	interrupt	9
//{
//	D_Int2Int = 1;
//	INTFLAG &= ~IE2;							//清P1IF中断标志
//}

/******************************************************************************************
** 函数名称: uart1_irq
** 函数描述: uart1中断处理函数
** 输入参数: 发送的数据的首地址
** 输出参数: 无 
*******************************************************************************************/
//void UART_int(void) interrupt 4
//{
//    if(RI)
//    {
//    	UartBuff[0] = UartBuff[1]; 
//    	UartBuff[1] = UartBuff[2]; 
//    	UartBuff[2] = UartBuff[3]; 
//        UartBuff[3] = SBUF;    //读取串口接收的数据
//        
//        if(UartBuff[0]==0xAA)
//        {
//          bHaveDate = 1;
//          ReveiceData[0] = UartBuff[0];
//          ReveiceData[1] = UartBuff[1];
//          ReveiceData[2] = UartBuff[2];
//          ReveiceData[3] = UartBuff[3];
//        }
//        RI=0;
//    }
//    if(TI)  TI=0;   //清除串口1发送中断标志	
//}
























//=============================================================================
