//=============================================================================
//Name		:SysInit.c
//Purpose	:初始化系统设置
//Version	:V1.0
//Author	:szl
//Date		:2015.05.26
//=============================================================================
#include "AllHeadFile.h"
//=============================================================================
unsigned char code PwmBz_Tab[] =
{
	25,		//0 %10
	50,		//1 %20
	75,		//2 %30
	100,		//3 %40
	128,		//4 %50
	153		//5 %60	
};

//=============================================================================
//功能：初始化需要使用的功能模块
//输入参数：无
//输出参数：无
//备注：	上电默认 Fsys = SRC，切换为 Fsys = FRC = 16.5888MHz/2 = 8.2944MHz
//=============================================================================
void InitDevice(void)
{
	EA=0;						//关闭总中断开关
	OPTION = WDTPSC_02;				//看门狗定时132ms
	AUX2  = 0;
	AUX1  = 0;
	WDT_RUN_FAST_DIS_ILDE;				//看门狗开
	PDOWN_LVD_DISABLE;
	LVRCON = LVRSEL_0011;			//LVR = 2.3V
	SysClk_Init();
	IO_Init();	
	ADC_Init();
	TM0_Init();
	TM1_Init();
	TM3_Init();
	PWM_Init();
	EA=1;						//开启总中断开关
}
//=============================================================================
//功能：系统时钟初始化
//输入参数：无
//输出参数：无
//备注：	上电默认 Fsys = SRC，切换为 Fsys = FRC = 16.5888MHz/2
//			Fsys 不能大于 6MHz
//=============================================================================
void SysClk_Init(void)
{	
	STPPCK = 1;	
	STPFCK = 0;	
	STPSCK = 0;		
	//Fsys(快时钟) 2分频 避免Fsys>6MHz
	CLKPSC_H = 1;		//SYSCLK Prescaler, 0:div16, 1:div4, 2:div2, 3:div1
	CLKPSC_L = 1;
	//分频后至少延时8个NOP	
	_nop_();	
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	//切换 Fsys = FRC		
	SELFCK = 1;
	//切换后至少延时8个NOP
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	_nop_();
	SCKTYPE = 1;
		
}
//=============================================================================
//功能：设置Fsys = FRC，Fsys = FRC = 16.5888MHz/2
//输入参数：无
//输出参数：无
//备注：2分频
//=============================================================================
//void SetFastClk(void)
//{
//	STPPCK = 0;	
//	STPFCK = 0;	
//
//	//Fsys(快慢时钟) 2分频 避免Fsys>6MHz
//	CLKCON = (CLKCON & CLKPSC_Mask)|CLKPSC_Div2;
//	//分频后至少延时8个NOP	
//	_nop_();	
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	//切换 Fsys = FRC		
//	SELFCK = 1;
//	//切换后至少延时8个NOP
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//}
//=============================================================================
//功能：设置Fsys=SRC，for IDL，Fsys = SRC = 24KHz
//输入参数：无
//输出参数：无
//备注：4分频
//=============================================================================
//void SetSlowClk(void)
//{
//	STPPCK = 0;	
//	STPFCK = 0;
//
//	//Fsys(快慢时钟) 4分频 避免Fsys>6MHz
//	CLKCON = (CLKCON & CLKPSC_Mask)|CLKPSC_Div2;
//	//分频后至少延时8个NOP	
//	_nop_();	
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	//切换 Fsys = SRC		
//	SELFCK = 0;
//	//切换后至少延时8个NOP
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	//停止UART/Timer0/Timer2/Timer2/ADC在空闲模式的时钟
//	STPPCK = 1;	
//	//停止快时钟以节省电流 			
//	STPFCK = 1;				
//	//切换后至少延时8个NOP
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//	_nop_();
//}

//=============================================================================
//功能：IO初始化，IO默认输出都为1
//输入参数：无
//输出参数：无
//备注：
//=============================================================================
void IO_Init(void)
{
	P0 = 0x00;
	// 00000000B
	// |||||||\---- LE1		  
	// ||||||\----- SCLK1
	// |||||\------ 				
	// ||||\------- SDA1
	// |||\-------- SDA2
	// ||\--------- 
	// |\---------- PWM1-OE
	// \----------- SCK2
	P0MOD10 = (P0MOD10&~0x0f)|2<<0;	  
	P0MOD10 = (P0MOD10&~0xf0)|2<<4;	
	P0MOD32 = (P0MOD32&~0x0f)|2<<0;		
	P0MOD32 = (P0MOD32&~0xf0)|2<<4;	
	P0MOD54 = (P0MOD54&~0x0f)|2<<0;	
	P0MOD54 = (P0MOD54&~0xf0)|2<<4;
	P0MOD76 = (P0MOD76&~0x0f)|2<<0;	
	P0MOD76 = (P0MOD76&~0xf0)|2<<4;

	
	P1 = 0x47;
	// 01000111B
	// |||||||\---- ADC_VR 		  
	// ||||||\----- CON
	// |||||\------ RF_DAT 						
	// ||||\------- 
	// |||\-------- 
	// ||\--------- 
	// |\---------- SDA
	// \----------- 
	P1MOD10 = (P1MOD10&~0x0f)|3<<0;	  
	P1MOD10 = (P1MOD10&~0xf0)|2<<4;	
	P1MOD32 = (P1MOD32&~0x0f)|1<<0;	
	P1MOD32 = (P1MOD32&~0xf0)|2<<4;
	P1MOD54 = (P1MOD54&~0x0f)|2<<0;	
	P1MOD54 = (P1MOD54&~0xf0)|2<<4;
	P1MOD76 = (P1MOD76&~0x0f)|1<<0;	
	P1MOD76 = (P1MOD76&~0xf0)|2<<4;
	
	P2 = 0x0E;
	// 00001110B
	// |||||||\---- PWM-BZ    
	// ||||||\----- DC_DET
	// |||||\------	OSCX
	// ||||\-------	OSCX 
	// |||\--------  
	// ||\---------   
	// |\---------- 
	// \----------- 
	P2MOD10 = (P2MOD10&~0x0f)|2<<0;	  
	P2MOD10 = (P2MOD10&~0xf0)|1<<4;	
	P2MOD32 = (P2MOD32&~0x0f)|0<<0;	
	P2MOD32 = (P2MOD32&~0xf0)|0<<4;
	P2MOD54 = (P2MOD54&~0x0f)|2<<0;	
	P2MOD54 = (P2MOD54&~0xf0)|2<<4;

	P3 = 0x4C;
	// 01001100B
	// |||||||\---- 		   
	// ||||||\----- 
	// |||||\------ ADC_KEY
	// ||||\------- P_LED
	// |||\-------- LE2
	// ||\--------- SEG1
	// |\---------- SCK
	// \----------- SEG2	
	P3MOD10 = (P3MOD10&~0x0f)|2<<0;	  
	P3MOD10 = (P3MOD10&~0xf0)|2<<4;	
	P3MOD32 = (P3MOD32&~0x0f)|3<<0;	
	P3MOD32 = (P3MOD32&~0xf0)|2<<4;	
	P3MOD54 = (P3MOD54&~0x0f)|2<<0;	
	P3MOD54 = (P3MOD54&~0xf0)|2<<4;
	P3MOD76 = (P3MOD76&~0x0f)|2<<0;	
	P3MOD76 = (P3MOD76&~0xf0)|2<<4;				
	
	INTE1 = 0;
	EX1 = 0;
	EX0 = 0;
	INTFLG = 0;		//io 中断标志
	IE1 = 0;
	IE0 = 0;
}

//=============================================================================
//功能：Int开启
//输入参数：无
//输出参数：无
//备注：
//=============================================================================
//void Int_Enable(void)
//{
//	INTFLG &= ~PCIF;						//清P1IF中断标志
//	INTE1 |= PCIE;							//IO中断使能
//}
////=============================================================================
////功能：Int关闭
////输入参数：无
////输出参数：无
////备注：
////=============================================================================
//void Int_Disable(void)
//{
//	INTE1 &= ~PCIE;							//IO中断使能
//	INTFLG &= ~PCIF;							//清P1IF中断标志
//}

//=============================================================================
//功能：定时器0初始化，定时模式，优先级为1
//输入参数：无
//输出参数：无
//备注：
//=============================================================================
void TM0_Init(void)
{		
	ET0= 0;			//TM0中断禁止	
	TR0= 0;			//TM0停止

	//屏蔽TM0门控信号
	TMOD &= ~GATE0;
	//计时模式（重要）	
	TMOD &= ~CT0;
	//TM0以方式1工作,16位计时/计数器
	TMOD = (TMOD & T0_Mask) | T0_Mode1;
	
	//定时时间
	TH0 = D_TM0H;								
	TL0 = D_TM0L;															
	
	//TM0 中断优先级为0
	IP &= ~PT0;									
	IPH &= ~IPH_PT0H;													
																
	ET0 = 1;								//TM0中断使能
	TF0 = 0;								//TM0中断标志清零
	TR0 = 1;								//TM0开启
}
//=============================================================================
//功能：定时器0开启
//输入参数：无
//输出参数：无
//备注：
//=============================================================================
void TM0_Enable(void)
{
	ET0 = 0;								//TM0中断使能
	TR0 = 0;	
	//定时时间
	TH0=D_TM0H;								
	TL0=D_TM0L;								//TM0开启
	ET0 = 1;								//TM0中断使能
	TF0 = 0;								//TM0中断标志清零
	TR0 = 1;	
}
//=============================================================================
//功能：定时器0关闭
//输入参数：无
//输出参数：无
//备注：
//=============================================================================
void TM0_Disable(void)
{
	TR0 = 0;								//TM0停止
	ET0 = 0;								//TM0中断禁止	
	TF0 = 0;								//TM0中断标志清零
}
//=============================================================================
//功能：定时器1初始化，定时模式，优先级为1
//输入参数：无
//输出参数：无
//备注：
//=============================================================================
void TM1_Init(void)
{
	ET1= 0;			//TM1中断禁止	
	TR1= 0;			//TM1停止

	//屏蔽TM1门控信号
	TMOD &= ~GATE1;
	//计时模式（重要）	
	TMOD &= ~CT1;
//	//TM1以方式2工作,8位重载
	TMOD = (TMOD & T1_Mask) | T1_Mode1;
	
	//定时时间
	TH1 = D_TM1H;								
	TL1 = D_TM1L;															
	
	//TM1 中断优先级为0
	IP &= ~PT1;									
	IPH &= ~IPH_PT1H;													
																
	ET1 = 1;								//TM1中断使能
	TF1 = 0;								//TM1中断标志清零
	TR1 = 1;								//TM1开启		
}
//=============================================================================
//功能：定时器1开启
//输入参数：无
//输出参数：无
//备注：
//=============================================================================
void TM1_Enable( void )
{
	ET1= 0;			//TM1中断禁止	
	TR1= 0;			//TM1停止
//	//定时时间
	TH1 = D_TM1H;
	TL1 = D_TM1L;
	
	ET1 = 1;								//TM1中断使能
	TF1 = 0;								//TM1中断标志清零
	TR1 = 1;								//TM1开启
}
//=============================================================================
//功能：定时器1关闭
//输入参数：无
//输出参数：无
//备注：
//=============================================================================
void TM1_Disable(void)
{
	TR1 = 0;								//TM1停止
	ET1 = 0;								//TM1中断禁止	
	TF1 = 0;								//TM1中断标志清零
}

//=============================================================================
//功能：定时器2初始化，中断优先级0
//输入参数：无
//输出参数：无
//备注：
//=============================================================================
//void TM2_Init(void)
//{
//	EXF2 = 0;
//	RCLK = 1;
//	TCLK = 1;
//	EXEN2 = 0;
//	TR2 = 0;								//TM2停止运行
//	
//	CT2 = 0;								//TM2为定时模式
//	CPRL2 = 0;								//重载模式	
//	
//	//定时时间
//	TH2 = D_TM2H; 
//	TL2 = D_TM2L;
//	RCP2H = D_TM2H; 
//	RCP2L = D_TM2L;
//	
//	//中断优先级0
//	IP &= ~PT2;
//	IPH &= ~IPH_PT2H; 
//
//	ET2 = 0;								//TM2中断使能
//	TF2 = 0;								//清TM2溢出中断标志
//	TR2 = 0;								//TM2开启运行
//	 
//}

/******************************************************************************************
** 函数名称: uart1_timer2_init
** 函数描述: uart初始化函数  9600-8-1 无校验（中断接收）
** 输入参数: 无
** 输出参数: 无
*******************************************************************************************/

//void uart1_timer2_init()
//{
//	PCON |= 0X80; 		//双波特率控制位
//
//        PORTIDX = 0x03;	
//	PINMOD10 = (PINMOD10&~0x0f)|0<<0;	  
//	PINMOD10 = (PINMOD10&~0xf0)|2<<4;
//	PINMOD = PINMOD & ~0x03 | 0x00;				//uart选用 txd p31   rxd p30
//	P3_1 = 1;
//	P3_0 = 1;
//	
//	SM0 = 0;
//	SM1 = 1;  				//模式1
//	SM2 = 0;
//
//	CT2 = 0;                                // 定时器模式，Timer2 的数据以 2 个系统时钟周期速率增加
//	TCLK = 1;                               // 模式1 或 3 时使用Timer2 溢出作为串行端口发送时钟
//	RCLK = 1;                               // 模式1 或 3 时使用Timer2 溢出作为串行端口接收时钟
//
//	TH2 = D_TM2H;   			// 9600   9.216MHz
//	TL2 = D_TM2L;
//	RCP2H = D_TM2H;
//	RCP2L = D_TM2L;
//
//	TR2 = 1;
//	REN = 1; 				              	// 允许接收
//
//	ES = 1;
//
//}

//=============================================================================
//功能：定时器2关闭
//输入参数：无
//输出参数：无
//备注：
//=============================================================================
//void TM2_Disable(void)
//{
//	TR2 = 0;
//	REN = 0; 
//	ES = 0;
//	RI=0;
//	TI=0;
//	
//	PORTIDX = 0x03;	
//	PINMOD10 = (PINMOD10&~0x0f)|1<<0;	  
//	PINMOD10 = (PINMOD10&~0xf0)|1<<4;
//	P3_1 = 1;
//	P3_0 = 1;
//}

//=============================================================================
//功能：定时器3初始化，中断优先级0
//输入参数：无
//输出参数：无
//备注：
//=============================================================================

void TM3_Init(void)
{
	CLRTM3 = 1;							//清除TM3
	OPTION &= ~TM3CKS;
	TM3RLD = (((unsigned long)0x10000-16384)>>8)&0xFF;		//溢出周期=500ms
	INTFLG &= ~TF3;							//清TM3中断标志
	IP1 &= ~PT3;
	IP1H &= ~PT3H;							//TM3中断优先级0
	INTE1 |= TM3IE;							//TM3中断使能
	CLRTM3 = 0;							//开启TM3
}

////=============================================================================
////功能：定时器3开启
////输入参数：无
////输出参数：无
////备注：
////=============================================================================
//
//void TM3_Enable(void)
//{
//	INTFLG &= ~TF3;							//清TM3中断标志
//	INTE1 |= TM3IE;							//TM3中断使能
//	CLRTM3 = 0;								//开启TM3	
//}
//
////=============================================================================
////功能：定时器3关闭
////输入参数：无
////输出参数：无
////备注：
////=============================================================================
//
//void TM3_Disable(void)
//{
//	INTFLG &= ~TF3;							//清TM3中断标志
//	INTE1 &= ~TM3IE;						//TM3中断关闭
//	CLRTM3 = 1;								//关闭TM3	
//}



//=============================================================================
//功能：ADC初始化
//输入参数：无
//输出参数：无
//备注：
//=============================================================================

void ADC_Init(void)
{
	//ADC Clock Rate:SysClk/8
	OPTION = (OPTION & ADCKS_Mask)|ADCKS_sys_16;
	ADCVERFS_VCC;		//VCC
//	ADCHSEL = ADCVERFS|VBG_01;		//VBG 2.0v
	//清ADC中断标志位	
	INTFLG = ~ADIF;						
}

u16 ADC_Convert( uchar Adc_ch )
{
  	static u16 adcNum;
  	uchar adcNumH;
  	uchar adcNumL;
  	ADCHSEL	= (ADCHSEL & ~0xf8)|Adc_ch;
  	ADSOC = 1;
  	while(ADSOC==1);
  	
  	adcNumL = ADCDL&0xF0;
  	adcNumH = ADCDH;
  	
  	adcNum = adcNumH*256 + adcNumL;
  	adcNum = (adcNum>>4)&0x0fff;
  	return(adcNum);
} 

u8 ADC_Convert1( uchar Adc_ch )
{
  	uchar adcNum;
  	ADCHSEL	= (ADCHSEL & ~0xf8)|Adc_ch;
  	ADSOC = 1;
  	while(ADSOC==1);
  	
  	adcNum = ADCDH;
  	
  	return(adcNum);
} 

//=============================================================================
//功能：PWM0 初始化
//输入参数：无
//输出参数：无
//备注： SYS_CLK = 16588800L/1
//=============================================================================

void PWM_Init(void)
{
	CLRPWM0 = 1; 				//PWM0关闭
	CLRPWM1 = 1; 				//PWM0关闭
	PWMCON = 0x00;				//PWM FSYSCLK
	PWMCON2 = 0x00;				//正常模式
	PWM0PRDL = 0xca;			//PWM0周期
	PWM0PRDH = 0x08;			//PWM0周期
	PWM1PRD = 0xff;				//PWM1周期 2k
	AUX3 = (AUX3&~0xe0)|0xA0;		//PWM1~6频率分频/32
	
	PWM0DL = 0x00;			 	//PWM0占空比
	PWM0DH = 0x00;
	PWM1D = 0;			 	//PWM1占空比
	PWM2D = 0;
	PWM3D = 0;
	PWM4D = 0;
	PWM5D = 0;
	PWM6D = 0;
}

void PWM_ALL_Off(void)
{
	CLRPWM1 = 1;	
	PWMCON &= ~PWM1EN;
	P0MOD76 = (P0MOD76&~0x0f)|2<<0;
	P0_6 = 0;
	P2MOD10 = (P2MOD10&~0x0f)|2<<0;
	P2_0 = 0;
}


void PWM_On(void)
{
	uchar tmp_duty;
	tmp_duty =9*DispLevel/10;
	if(DispLevel)
	{
		PWM1D = 255-tmp_duty;	
		P0MOD76 = (P0MOD76&~0x0f)|11<<0;
	}	
	else
	{
		P0MOD76 = (P0MOD76&~0x0f)|2<<0;
		P0_6 = 1;
	}	
	CLRPWM1 = 0;	
	PWMCON |= PWM1EN;
}		

void PWM_Off(void)
{
	P0MOD76 = (P0MOD76&~0x0f)|2<<0;
	P0_6 = 0;
}	

//=============================================================================
//功能：T2O 初始化
//输入参数：无
//输出参数：无
//备注：  输出2KHZ频率，驱动蜂鸣器
//=============================================================================
void T2O_On(void)
{
//	if(ProFlag1&D_ToneDis)
//	{
//		P2MOD10 = (P2MOD10&~0x0f)|2<<0;
//		P2_0 = 0;
//	}
//	else
//	{
//		PWM2D = PwmBz_Tab[SoundLv];	
//		P2MOD10 = (P2MOD10&~0x0f)|11<<0;
//	}	
	
	PWM2D = PwmBz_Tab[SoundLv];	
	P2MOD10 = (P2MOD10&~0x0f)|11<<0;
	CLRPWM1 = 0;	
	PWMCON |= PWM1EN;
}

void T2O_Off(void)
{
	P2MOD10 = (P2MOD10&~0x0f)|2<<0;
	P2_0 = 0;
}

//=============================================================================
