//=============================================================================
//Name		:TypeDef.h
//Purpose	:常量定义
//Version	:V1.0
//Author	:szl
//Date		:2015.05.26
//=============================================================================
#ifndef __TYPEDEF_H__
#define	__TYPEDEF_H__
//=============================================================================
//=============================================================================
typedef bit BIT;
typedef bit BOOL;
typedef unsigned char 	u8;
typedef unsigned char 	uchar;
typedef unsigned int	uint;
typedef unsigned int	u16;
typedef unsigned long 	ulong;
typedef unsigned long 	u32;
//=============================================================================
#define	TRUE	1
#define	FALSE	0
//=============================================================================
#define	BIT7	0x80
#define	BIT6	0x40
#define	BIT5	0x20
#define	BIT4	0x10
#define	BIT3	0x08
#define	BIT2	0x04
#define	BIT1	0x02
#define	BIT0	0x01
//=============================================================================
/*IO 口定义*/
#define IO_DC_DET	P2_1
#define IO_CON		P1_1

#define ADCHS13	(0x0d<<3)	//01101: AD13 (P3.2)
#define ADCHS27	(0x1b<<3)	//11011: AD27 (P1.0)

//=============================================================================
//Timer0 定时时间

#define SYS_CLK	16588800L/1

#define	D_TM0H	(65536-(SYS_CLK/256/2))/256	
#define	D_TM0L	(65536-(SYS_CLK/256/2))%256	//256hz,Fsys/2
//Timer1 定时时间
#define	D_TM1H	(65536-(SYS_CLK/8192/2))/256	
#define	D_TM1L	(65536-(SYS_CLK/8192/2))%256	//8khz,Fsys/2
//Timer2 定时时间
#define	D_TM2H	(65536-(SYS_CLK/9600/32))/256	
#define	D_TM2L	(65536-(SYS_CLK/9600/32))%256	//9600,Fsys/2
//=============================================================================	

//=============================================================================
#endif
//=============================================================================